[
    {
        "title": "Welcome to My Blog!",
        "content": "This is the first post in my personal blog. I'll be sharing my thoughts and experiences here.",
        "date": "8/7/25",
        "category": "General"
    },
    {
        "title": "The Wiggle That Killed Tarkov",
        "content": "<br> Credit: <a href=\"https://www.youtube.com/watch?v=p5LfGcDB7Ek\" aria-label=\"Watch g0at's video about Tarkov cheating\">g0at</a> <br> <br> Tarkov player goes undercover with ESP (extra sensory perception; wallhacks) and wiggles to find other wallhackers. g0at, the creator of this YouTube video, goes on the first person shooter survival game, Escape from Tarkov, and pretends to be a cheater in order to find cheaters. Even though he is using a wallhack cheat, he is not using other hacks like aimbot or flying around. Furthermore, g0at does not shoot other players nor does he loot other players. In game, when he is near enough another player, he tests them for cheating. He leans left and right, which is a movement mechanic normally used to peek around corners, or to indicate friendliness. He 'wiggles', facing walls, even though a legitimate player would not be able to see the movement. On the other end, cheaters who use wallhacks will see him peek, although they have to decide whether or not to 'reveal' themselves as seeing g0at through the wall that is blocking both players' views. g0at pretends to be friendly, continues following suspicious players, and even gets a few cheaters to admit to hacking. However not all of the cheating players wave back, and instantly take a shot at g0at when he is in clear view. This video shows how playing competitive games is not really fun, as cheaters will always exist, and there is nothing non-cheaters can do about it. ",
        "date": "8/7/25",
        "href": "https://www.youtube.com/watch?v=p5LfGcDB7Ek",
        "category": "Gaming"
    },
    {
        "title": "The Online Chess Cheating Problem",
        "content": "<br> If you don't have the time to read this, here is a picture: <a href=\"https://old.reddit.com/r/chess/comments/xyx3i4/there_are_a_lot_of_cheaters_on_chesscom/irj68l2/\" aria-label=\"View Reddit post about chess cheating statistics\"> Reddit <img src=\"/static/chesscheaters.png\" alt=\"Chess cheating statistics showing 15.7% of players are cheaters\" aria-label=\"Chess cheating statistics\"> </a> <br> What it says is that 15.7% of online chess players are cheaters, and over 20% have admitted to cheating in the past. Does this mean everyone online is a cheater? No, especially not at the lower levels, below 1600 elo. Losing points, not improving, and wasting time is not worth the effort.<br> <br> Chess is one of the oldest board games that had recorded games as early as the 16th century, coinciding with the birth of Ruy López de Segura, of Spain, who was known as the best player of early chess. Ruy López popularized the most famous Chess opening known as the Ruy Lopez, or Spanish game, that starts with:                                    <br><br> 1. e4 e5, 2. nf3 nc6, 3. bb5 ...  , undermining Black's knight or defense of the center e pawn, and giving white a slight initiative. Even today, Chess is still played throughout the world, and is even mandatory in Armenia for school children. Chess is also played online on sites like Chess.com and Lichess.org, which can have over 50,000 games being played at the same time, per platform. Chess is also popularized in the modern age by the Queen's Gambit movie, which was a 2020 fiction drama movie starring Anya Taylor-Joy who played Beth Harmon, a top fenmale chess player.                                  <br><br>  So then, where does Chess fall off? To a newer player of the game, who might have played a couple of games with their friends in the past, or someone who has watched the Queen's Gambit movie, it is very difficult to tell that up to 20% of their online opponents are actual cheaters. First of all, online chess is completely free to play. Players can make as many accounts as they would like. However, players can not cheat as they like, since cheating is a bannable offense. Therefore, all a cheater needs to do is load up a chess engine as a browser extension or on their phone, not blatantly look up and play the best move for every match they play, and they will have an unfair advantage after the first couple of opening moves for the rest of the game.      <img src=\"/static/chessvision.png\" alt=\"Chessvision.ai Chrome extension interface showing chess analysis\" aria-label=\"Chessvision.ai extension interface\"> </a>  <br> <br> For example, 'Chessvision.ai' is a Chrome extension that has over 100,000 users. The description says:'Analyze chess positions from any website, book, and video in Chrome | Automatically analyze chess positions on any website and video you want.' This extension automatically scans for any chess board, detects the current position on the board, and opens up a mini-window that shows an engine evaluation of the current position. Keep in mind the 100,000 users number, this is only a single example tool that anyone can use for free online. There are dozens of alternative extension or software cheating tools to choose from.     ",
        "date": "8/7/25",
        "category": "Gaming"
    },
    {
        "title": "Starcraft 2: A Deteriorating Mess",
        "content": "<br> <img src=\"/static/sc2.png\" alt=\"My Recent Starcraft 2 Matches showing match history\" aria-label=\"Recent Starcraft 2 match history\"> </a> Starcraft 2, or sc2, has been known as one of the most popular RTS (real time strategy) games, the newer rendition of the original Starcraft series, which was released in 2010 and saw popularity from 2012-2016 until losing popularity to newer games like Counter Strike, League of Legends, and Fortnite. However, the days of Sc2 are long over, and Sc2's developer, Blizzard Entertainment, has never looked back. Moreover, once Sc2's multiplayer 1v1 mode was made free to play on November 2017, this was the start of Sc2's downfall. For veteran players, the multiplayer player pool, or ladder, was swarmed with mostly new players who had no other sense of the game other than watching pro players play or their friends. Starcraft 2 is not an easy game to play, it is certainly not beginner friendly. No matter how many hours a new player has watched the game, new players need a minimum of 100 hours in the game to learn the controls and how to not lose instantly when being matched against a real opponent. To win consistently against real opponents in the middle 50th percentile? Well atleast 500 hours watched and played in game.               <br><br> I myself have put in atleast 500 hours in the game played, and maybe 500 hours watching YouTube videos and Twitch streams. In 2018 I reached Diamond 3, or the top 25% of players on the NA ladder. However, I stopped playing and returned to the game in 2021 and 2025. What do you think happened once Blizzard made the game free to play? Well, the short answer is that the current 1v1 ladder in 2025 is flooded with veterans, sandbaggers, and smurfs, which makes the game extremely difficult to play for new players but even experienced players that aren't sandbagging their actual rating.                  <br><br> What is Sandbagging? Sandbagging is a term used in gaming where a player deliberately lowers their rating by leaving matches or losing games on purpose in order to get matched against lower rated opponents. The result of sandbagging is that if you are currently rated 3000 rating points on the ladder, if you get matched against a sandbagger (or smurf), you will be at an unfair disadvantage. First of all, you do not know your opponent's actual rating, and you also do not know that they are playing below their actual rating, atleast until you end up losing the game, when it's already too late.<br><br> For clarification, the difference between smurfs and sandbaggers is that smurfs deliberately make multiple accounts that aren't their main account in order to conceal or freeze their main account's top rating. So although smurfing is not technically cheating or hacking, it gives smurfs an unfair advantage, equivalent to match fixing in professional sports, or rating manipulation, which are bannable offenses. Since Blizzard has not addressed the issues of smurfing and sandbagging, there has been no improvement since 2017. I would estimate the current percentage of smurfs/sandbaggers to be at least 20% of the players in the range of 2700-4000 MMR (Match making rating) rating points, peaking at 33% during certain times of the day, such as late at night or during weekdays. <br> <br> So what is actually going on, then? Well, since I am currently at 2900 MMR, or Platinum 2, up to 33% of my games are playing against smurfs and sandbaggers who are actually 3300-3600 MMR points, which nearly guarantees that the game will end in an unfair loss. What sandbaggers/smurfs do is that they leave 4-7 games in a row, or atleast one game for every game they won, when their account is currently under 500 MMR their main account or actual rating. As a result, they will always be getting matched against players who are weaker than them, and win, depending on how many games they decide to leave. Since the other 70% of players are not smurfs or sandbaggers, the only way they can lose is if they get matched against another smurf/sandbagger, which might occur in less than 5-10% of total games, and isn't a problem for the smurf/sandbagger. Keep in mind that the match making system does not address smurfs and sandbaggers, so it doesn't mean that a player going on a win streak is going to get matched against another player going on a win streak. In fact, the only reason I was able to get promoted from Gold 2 to Platinum 3 was having to both play better than my actual rating, and not get matched against smurfs and sandbaggers. If Blizzard did actually address the sandbagger smurf problem with Sc2, I would actually be in Diamond 2 at this point, and not have to be stuck in Platinum 2.",
        "date": "8/9/25",
        "category": "Gaming"
    },
    {
        "title": "Chess, What I Learned",
        "content": "<br> My Lichess Rating <img src=\"/static/lichessRating.png\" alt=\"My Lichess chess rating showing over 2000 rating points\" aria-label=\"Lichess chess rating over 2000\"> </a> <br> Even though online Chess is not guaranteed to be clean, I have probably played some brilliant moves on Chess.com and not regretted it. The picture shows that I indeed have a rating over 2000, but I haven't played for a couple of months as of this date. This post will serve as general advice towards new players who are interested in playing Chess, specifically online chess in the rapid time category. Chess is a game of memorization, pattern recognition, and positional initiative. Each player starts out with their pieces on their starting squares. Original chess theory before the modern age of chess hypothesized that moving your center pawns forward towards the center of the board was a way to claim positional space on the board, which increases the moveability of your own pieces while at the same time cramping your opponent's pieces. Since your pawns can only forward, they are the weakest piece in the opening. Moving your center pawn forward gives each of your other pieces more space to develop and move out of their opening positions. This e4 or d4 move in the opning is considered good for challenging your opponent's center, which gives your pieces better attacking chances and more initiative. This is a vast generalization of the idea behind e4/d4, but it might make sense if you are starting to learn the game. Later on, chess theory turned more towards g6 or nf6 as black if your white opponent goes e4 or d4, respectively. The idea behind this is that there is no longer the 1. e4-e5 tension in the center, which allows a slightly more diverse set of opening choices for black that isn't fighting for the center. Instead of e5, black goes g6 and then bg7, which fianchettos the black dark squared bishop and prepares for king side castling. In addition, the bishop on g7 is eying the center d4 square, which white would like to place their pawn after e4 for more center space. This opening is called the modern opening, where white goes e4, then d4 or nf3, and black responds with g6 and bg7. While white is claiming space in the center, black is responding with a quick king side castle defense and attacking the center indirectly with its dark square bishop on g7. For beginners, keep in mind that pushing e4 e5 d4 d5 might undermine your center defense in the middlegame, as center pawns are also the easiest to target. <img src=\"/static/modern.png\" alt=\"Modern Defense chess opening with 1. e4 g6\" aria-label=\"Modern Defense chess opening\"> Black's idea in the opening is to quickly develop its pieces to allow it to castle king side or queenside. White's idea is to gain space in the center, to later potentially give it better attacking chances towards Black's king. <br> <br> to an intermediate player, this advice sounds too basic, so let me turn to more advanced topics around my rating range. Disregard if your rating is much higher than mines as this should already be familiar territory. In the middlegame, many players lack a plan to either go after your opponent's king or try to further undermine/cramp your opponent's pieces/position. Some players might miss an important tactical shot in the middlegame, which could be potentially game changing. For example, as white if black pins your c3 knight or f3 knight with their corresponding bishops on b4/g4, white can always reply with a3,b4 or h3, g4 to kick the bishop and take more space on the sides of the board. Even though h3/g4 weakens the kingside castling position, it allows for more attacking chances. Similarly, if you are playing black and white pins your f6 knight with bg5, h6 and g5 can be a good attacking response in certain lines. If both sides have castled kingside, black can usually play h6/g5 to play a kingside pawn storm attack towards white's king. <br> <br> As White, I have a preference for 1.d4 openings, specifically the Catalan opening, or the Jobava-London. <img src=\"/static/catalan.png\" alt=\"Catalan Opening chess position with 1.d4 Nf6 2.c4 e6 3.g3\" aria-label=\"Catalan Opening chess position\"> If black doesn't respond properly and immediately try to play e5 nc6, white will have a comfortable opening and easy to play middlegame. If you don't know what these openings are, it's basically a Queen's Gambit Declined (QGD) with white's light squared bishop fianchettoed on g3 in addition. This opening gives white center pawn control, center pawn reinforcement from the fianchettoed bishop, and a sound kingside castle. The Catalan has been played at the highest levels of chess recently, and thats why I also like it. <br> <br> As black, I usually play g6, the Modern, in response to 1. e4. If white brazingly tries to attack and center pawn storm without developing enough their other pieces, they sometimes fumble defense of a pawn and their stack of card pawn structure usually collapses. However, be wary of later h4 moves, as a good attacking player will be able to attack and take initiative before their center position starts to weaken. 1.d4 nf6! is another common idea for black, as its the most popular opening response to d4 for black. D6 is also another transposing opening choice against d4, but I feel like it is too passive and gives white a more comfortable opening position. The way to win games above the beginner level is to restrict your opponent's moves, pressure the weaknesses in their position (pawn breaks), and seize the initiative in the position when given the chance. However, as I mentioned before, you need to understands and 'see' the middlegame patterns for when there's a tactic or when there's a certain weakness in your opponents position that can be exploited. <br> <br> if you manage to make it to the endgame versus an equally rated opponent, it's even more necessary to overdefend your minor pieces or center pawns as rooks can quickly target weak pawns and scoop them up from the side files or even behind your overpushed/weak exposed pawns. I would say I have lost many games in an equal position due to overlooking a two-move combo from my opponents rook that would quickly slide from the back towards the sides of the board and attack my pawns aligned horziontally past the middle ranks. Theres a common technique to cutoff the king where you slide your rooks to the seventh rank, preventing your opponent's king from marching towards the center and being able to escort their passed pawns. Stockfish sometimes gives +-5 just from a cutoff king, as there is both the threat of being checkmated on the last rank as well as not being able to promote or defend their passed pawns. <br> <br> Knights are the most dangerous in short time controls or time pressure, as it's easy to fork a rook and king at the same time when there aren't many pieces on the board. <br> <br> for lower rated players or beginners, I would also recommend th Pirc Defense, as it gives an alternative center counter towards e4-e5 that isn't as passive as e6 or g6. The Scandinavian Defense is also an annoying center-counter response to your opponent if they were just planning on going e4, d4, e5. It's a more advanced variation that is more dangerous for beginners, as center queens can quickly be activated, so I wouldn't recommend it completely. Knight outposts in the middlegame are also very annoying to deal with. If they can't be kicked with a pawn, or the pawns forming the knight outpost, then knights on outposts are worth atleast a rook, especially if they are towards the center or your opponent's king. If you want to play it safe, develop your pieces enough so that center knights can be traded off by bishops or atleast kicked away by h6 or h3.       ",
        "date": "8/18/25",
        "category": "Gaming"
    },
    {
        "title": "Starcraft 2 Gold/Platinum Terran Guide",
        "content": "<br> My Sc2 Rating <img src=\"/static/diamond3.png\" alt=\"My Starcraft 2 Diamond 3 rating showing 3140 MMR\" aria-label=\"Starcraft 2 Diamond 3 rating\"> </a> <br> I am now Diamond 3 on the NA ladder, or about 3140 MMR. This puts me at about top 25% of NA Starcraft 2 players, so I would say I have some experience playing the game as the Terran race. <br> <br> To start, I will say that the NA ladder has the stereotype of being more cheesy than the other EU and KR servers, meaning you will face more early aggressive builds that are meant to quickly crush their opponent. However, don't worry if you are losing to cheese as a beginner, it's one way to learn how the mechanics of the game work and where your build order or strategy is weak. As a terran, it's not easy to play bio (marines, marauders, medivacs) near the midgame and lategame, as bio requires a very fast and micro-intensive playstyle. For example, if you open standard reaper fast expand against zerg, you will need to micro your reapar to both pressure the zergs natural as well as being able to build your factory at 100 gas. If you only do one or the other, chances are you will quickly fall behind of your opponent. So for beginners, playing marine first into reactor is less micro intensive and much easier to play. However, your first reaper will importantly scout against early ling pressure, baneling bust, or two base roach all-ins. The main idea for terran bio against zerg is to send out 1/2 marine medivac drops to clear creep and deny new expansions. Terran, as bio, must be proactive enough to drop both sides of the map at once, and setup tank pushes at the same time. If not, zerg will be comfortable enough to go to brood lord/viper/infestor, which shuts down tank pushes immediately. If the zerg goes multiple spores in their main, or goes muta/ling/bane, then drop play should only be for clearing creep or denying expansions, dropping in the main or naturals is usually not worth it. <br> <br> Against terran I would go reaper reaper hellion, but defensively until your hellion is finished. Try to take out your opponent's reaper or 2 scvs if possible. Next would be reactored marines, one or two cyclones, and tanks/raven afterward. An early cyclone helps shut down one base medivac drops and can kill reaper reaper hellion. If you're not comfortable playing ravens, then don't, play vikings instead. Vikings will beat poorly microed ravens, medivacs, liberators, and even battlecruisers, if given the chance. So marine tank viking as bio, just keep your macro and upgrades in check. Always have atleast 2 barracks for each expansion you have, to ensure you won't get completely wiped out if your marines accidentally walk into tank fire. <br> <br> One important note to mention, in TvT, make sure you watch out for a two base battlecruiser build, one base tank drop build, or proxies. Since pro players play bio instead of mech in 75% of games, bio is what I play, but if you like mech, then go for it. Mech is good against zerg, but against a tactical bio player or protoss you can be easily outpositioned or outplayed. I actually think mech is the better build for players under diamond, as tank/viking doesn't require much micro and defense is easier. <br> <br> If you play against protoss, go normal 1rax/reactor into delayed proxy double marauders, just make sure the protoss player doesn't see the two proxy scvs leaving your base - this is how I reached diamond with a 70% winrate vs protoss. Similarly, against zerg, you can go for the proxy 4 rax marines build. The proxy 4 rax is very strong against weaker opponents, and even if the zerg defends their main with spines, you will just bunker contain their natural and followup with a normal expansion into tank push. After the first rax is finished, that scv will immediately build the fourth rax. Rally each scv 12s in-between across the map to ensure efficient build timing and mineral expenditure/mining. If you're smart, you would rally your scvs around the shortest overlord scout path and slightly past your opponents fourth expansion. I would say that with proper execution, no zerg player under gold 1 should be able to fully defend or figure out the correct followup if they manage to defend their main. Just ensure the zerg doesn't sneak out zerglings across the map and make sure to build the 3 supply depots to blockade your main ramp. In standard reaper fast expand vs zerg, you can also choose to wall off your natural base instead of your main ramp if you want. Just keep in mind this is more risky against baneling busts and 2-base roach attacks before your tank is able to finish. However if you manage to keep your reaper alive, you will quickly understand the importance of the reaper in the build. <br> <br> For scouting against terran and zerg, you can rally a scv from your main to your opponent's ramp when your rax is about 40% finished. You can also optionally scout your third expansion first for proxies (against terran) before rallying to your opponent's ramp. Against protoss, you don't really need to scout, the reason being you should always put a bunker at your natural to defend against early adept/stalker prsesure. Going 2/1/1 cyclone first helps deny proxy voids, and raven first  helps deny DTs. Two-base marine/marauder tank medivac all-in with 5-10 scvs pulled or mine drop would be my build recommendations against protoss if you choose to play standard instead. Just make sure stim finishes and your scvs pad for your tank, you can set your scvs on hold position to help deny chargelots. <br> <br> Control groups: Main army hotkey on 1. Ghosts, air units, your dropping medivacs, or tanks on 2. Try to not to F2 a-move as much when you are getting better at the game, you can watch how pro players choose to hotkey on streams or Youtube videos if they aren't hidden.  ",
        "date": "8/19/25",
        "category": "Gaming"
    },
    {
        "title": "Battlefield 1: Great Visuals, Appropriate Themes, but Some Balance Issues",
        "content": "<br> <img src=\"/static/bf1.png\" alt=\"My Battlefield 1 profile showing game statistics\" aria-label=\"Battlefield 1 profile\">My BF1 Profile</a> <br> <br> Battlefield 1 might be one of the best FPS games ever made, and even in the year 2025, there is still a moderate  daily playerbase in the 1000s on Steamcharts. The cinematic videos are not too far off from actual gameplay, as in the visual details: shaders, textures, and terrain are all visually stunning. Effects aren't as realistic, but the explosions and footsteps help make up for average fire/explosion effects. Most buildings are fully destructible from direct tank shelling or bombers, and the collapse animation physics helps contribute to the immersive battlefield experience. The majority of the maps, for example Monte Grappa and Passchendaele, have a distinct immersive feel the first time you play on them. Fort De Vaux, Amiens, and Suez are also some visually appealing maps. Because BF1 is based on World War 1, the map design's account for historical accuracy is a step up from the more fictional battlegrounds in modern warfare games or futuristic titles. BF1 doesn't have the best maps, I have played some better lookings map on Enlisted, especially on the Normandy Campaign and the Battle for Berlin/Stalingrad maps. It's sad that Enlisted has some clunky sprinting movement, with the mechanics of Bf1 Enlisted's maps would definitely help make a combined title stand out. Even though Battlefield 5's maps, based on WW2 were technically designed to be more accurate, the gameplay felt boring since you had to trek across half of the map just to reach a middle point. <br> <br> Mechanics: Battlefield 1 has had some complaints of being a run and gun type of game, especially on maps like Fort De Vaux or Prise de Tahure. The familiar three lane flanking routes and linear gameplay on those smaller maps are more like Call of Duty, but the starting areas look and feel realistic in a sense. From a spectator's viewpoint with the Heads Up Display disabled, the game looks great from a cinematic standpoint, for example on Argonne or Suez. <br> <br> However, balance is the greatest downside of Bf1. Although from a designer's point of view the run and gun style of BF1 makes sense to compete with CoD Modern Warfare, the gameplay feels extremely off at times when you have to face an experienced veteran tank player or attack helicopter player with 150 service stars. For clarity, it takes 100 kills to gain 1 service star for any class of weapon/vehicle in the game. What ends up happening is that most of the game lobbies nowadays have multiple veteran players, who are playing for kills and end up being really disheartening for newer players looking for an immersive experience rather than just getting kills or winning the matches. <br> <br> Autorepair: awful design for infantry, easy gameplay for vehicle players. Generally, vehicle players prefer choosing vehicles while fps gamers like to play the simple assuault class infantry. However, vehicles are awfully balanced in BF1 when in the hands of a veteran player. First of all, medium tanks take a minimum of 3 anti-tank grenades to destroy, which might make realistic sense, but even light tanks take atleast 2 anti-tank grenades to explode. Bullets do zero damage to tanks, with the slight exception of a tankgewehr special class or sniper k-bullets, which barely do any damage to even light tanks. It doesn't make sense how a single tank can plow through a field of infantry if they maintain their distance and fire from a range beforehand. Anti tank grenades don't throw further than 20 meters, so all it takes is a tank to camp a chokepoint from a 50 meter distance to be unkillable by infantry. For fighter airplanes, the stationary anti-air turrets have to directly hit 8 flak shells to even take down a single plane. An experienced fighter pilot can just strafe and sweep through once every 20-30 seconds, and they will be untouchable, with the exception of other enemy pilots. So if the enemy team has a good tank or pilot, and your team doesn't, the game is essentially lost on the maps with low cover and wide-open point spaces. Even worse, the auto-repair mechanic tanks/airplanes allows pilots to reapir damaged vehicles good as new with no limit. Tanks also require 3 direct tank shots to kill, so good luck trying to prevent tanks from auto-repairing everytime they get hit once. <br> <br> Gunplay: Kind of Bad. Battlefield 1 guns have few if any recoil, especially on shotguns. This essentially means that two players fighting with automatic weapons at 10 meters is determined completely by luck or the random spread of the weapon. Moreover, automatic weapon headshot damage is heavily nerfed in BF1. An mp40 takes over 4 headshots after A 25m dropoff to even take down a player, which is incredibly frustrating to play with. Even revolver headshots don't immediately drop your opponent after a 10m dropoff, you have to carefully aim two times and hit two separate headshots to even claim a headshot kill. Snipers, however can mostly one shot headshot within the damage dropoff range of 70 meters. Certain semi-auto rifles in the Medic class can also two shot headshot <20m. However in real life not even a heavy ballistic helmet could survive a rifle caliber bullet. <br> <br> Spotting flares: a gamebreaking mechanic. Snipers have the option to equip a spot flare gun, which shoots up to ~40m in one direction, but reveals a ~120m radius on the minimap that shows where moving players are for your entire team to see. The problem is that the spot flare is basically wallhacks, hiding in a building won't save a player unless they have the inconspicuous perk and do not move at all. As a result, flanking and playing strategically gets shut down completely by a single flare. This mechanic would not be an issue if the main player mode was hardcore with no heads up display minimap, but unfortunately 64 player conquest is the main played mode in multiplayer servers. In addition, pressing 'q' instantly spots a visible enemy player and marks them on the minimap for your entire team, so good luck running in the middle opening of a choke. I won't go into other annoyances like gas nades or support resupply grenade spam on Fort, you will quickly see what I am talking about when you experience it in-game.<img src=\"/static/apocalypsebf1.jpg\" alt=\"Battlefield 1 Passchendaele map showing WW1 battlefield\" aria-label=\"Battlefield 1 Passchendaele map\">Passchendaele</a> <br> <br> In conclusion, BF1 could have been, or be, the greatest FPS game even today, if the developers tweaked vehicles to be more fragile, bullet damage ot be more realistic, and spotting to be less invasive.    ",
        "date": "8/19/25",
        "category": "Gaming"
    },
    {
        "title": "Steroid Users on Social Media and Body Dysmorphia",
        "content": "<br> <img src=\"/static/fakenatty.jpg\" alt=\"Fake Natty\" aria-label=\"Liver King \">Fake Natty</a> <br> <br> Do you go to the gym? Do you recognize several guys at the gym that seem to be there every day of the week? At seemingly random times of the day? Chances are atleast one of those people are on steroids, or performance enhancing drugs, SARMS, anabolics, testosterone, HGH. Particularly those who have proportionally large upper delts, traps, and shoulders. If not, then theres a 99% chance you have seen atleast one 'fitness influencer' on Instagram that looks big but is on anabolic steroids. These Instagram portfolios are based on how the user looks, and promote their own account through gym supplement sponsorships and merchandise. For the younger generation, having these profiles show up on their social media feeds is problematic, as some insecure individuals might feel what is called body dysmorphia, or having compelling OCD-like thoughts that lowers one's self esteem and compels one to eat less or go to the gym frequently, with unrealistic or natural standards. Having larger muscles might look better, but it makes the heart work harder. The dark side of anabolic abuse is decreased lifespan and early heart failure in bodybuilders. However, TRT, or testosterone replacement therapy, might be a more safer option for male individuals over the age of 50 when testosterone levels start to decline or have noticeably declined already. <br><br> If you're still unsure if someone is on steroids, identify if someone has low body fat, capped shoulders, and large upper deltoid muscles. From the reference picture it's clear that this individual has all three in addition to defined vascularity in the arms, which is a common indicator of low body fat and subsequent steroid use. This person's upper arms look almost bigger than his upper pecs or chest muscles.   ",
        "date": "8/24/25",
        "category": "General"
    }
]
