[
    {
        "title": "Welcome to My Blog!",
        "content": "This is the first post in my personal blog. I'll be sharing my thoughts and experiences here.",
        "date": "8/7/25"
    },
    {
        "title": "The Wiggle That Killed Tarkov",
        "content": "<br> Credit: <a href=\"https://www.youtube.com/watch?v=p5LfGcDB7Ek\">g0at</a>Tarkov player goes undercover and wiggles to find wallhackers.g0at, the creator of this YouTube video, goes on the first person shooter survival game, Escape from Tarkov, and pretends to be a cheater in order to find cheaters. In game, he leans left and right, which is a movement mechanic normally used to peek around corners, or to indicate friendliness. He wiggles facing walls, even though he cannot see through walls. On the other end, certain cheaters will see him peek, but since they are cheating, the wall is not a visual deterrent, and some might even think that he is also wallhacking. However, he isn't. g0at pretends to be friendly, doesn't get shot, and even gets a few cheaters to admit to hacking. This video shows that it's a general waste of time to play competitive games, as cheaters will always exist, and there is nothing you can do about it.",
        "date": "8/7/25",
        "href": "https://www.youtube.com/watch?v=p5LfGcDB7Ek"
    },
    {
        "title": "The Online Chess Cheating Problem",
        "content": "<br> If you don't want to read my story, here is a picture: <a href=\"https://old.reddit.com/r/chess/comments/xyx3i4/there_are_a_lot_of_cheaters_on_chesscom/irj68l2/\"> Reddit <img src=\"/static/chesscheaters.png\" alt=\"Chess Cheaters\"> </a> What it says is that 15.7% of online chess players are cheaters, and over 20% have admitted to cheating in the past. Does this mean everyone online is a cheater? No, especially not at the lower levels, below 1600 elo. Losing points, not improving, and wasting time is not worth the effort.",
        "date": "8/7/25"
    },
    {
        "title": "Starcraft 2: A Deteriorating Mess",
        "content": "<br> <img src=\"/static/sc2.png\" alt=\"My Recent Matches\"> </a> Starcraft 2, or sc2, has been known as one of the most popular RTS (real time strategy) games, the newer rendition of the original Starcraft series, which was released in 2010 and saw popularity from 2012-2016 until losing popularity to newer games like Counter Strike, League of Legends, and Fortnite. However, the days of Sc2 are long over, and Sc2's developer, Blizzard Entertainment, has never looked back. Moreover, once Sc2's multiplayer 1v1 mode was made free to play on November 2017, this was the start of Sc2's downfall. For veteran players, the multiplayer player pool, or ladder, was swarmed with mostly new players who had no other sense of the game other than watching pro players play or their friends. Starcraft 2 is not an easy game to play, it is certainly not beginner friendly. No matter how many hours a new player has watched the game, new players need a minimum of 100 hours in the game to learn the controls and how to not lose instantly when being matched against a real opponent. To win consistently against real opponents in the middle 50th percentile? Well atleast 500 hours watched and played in game.               <br><br> I myself have put in atleast 500 hours in the game played, and maybe 500 hours watching YouTube videos and Twitch streams. In 2018 I reached Diamond 3, or the top 25% of players on the NA ladder. However, I stopped playing and returned to the game in 2021 and 2025. What do you think happened once Blizzard made the game free to play? Well, the short answer is that the current 1v1 ladder in 2025 is flooded with veterans, sandbaggers, and smurfs, which makes the game extremely difficult to play for new players but even experienced players that aren't sandbagging their actual rating.                  <br><br> What is Sandbagging? Sandbagging is a term used in gaming where a player deliberately lowers their rating by leaving matches or losing games on purpose in order to get matched against lower rated opponents. The result of sandbagging is that if you are currently rated 3000 rating points on the ladder, if you get matched against a sandbagger (or smurf), you will be at an unfair disadvantage. First of all, you do not know your opponent's actual rating, and you also do not know that they are playing below their actual rating, atleast until you end up losing the game, when it's already too late.<br><br> For clarification, the difference between smurfs and sandbaggers is that smurfs deliberately make multiple accounts that aren't their main account in order to conceal or freeze their main account's top rating. So although smurfing is not technically cheating or hacking, it gives smurfs an unfair advantage, equivalent to match fixing in professional sports, or rating manipulation, which are bannable offenses. Since Blizzard has not addressed the issues of smurfing and sandbagging, there has been no improvement since 2017. I would estimate the current percentage of smurfs/sandbaggers to be at least 20% of the players in the range of 2700-4000 MMR (Match making rating) rating points, peaking at 33% during certain times of the day, such as late at night or during weekdays. <br> <br> So what is actually going on, then? Well, since I am currently at 2900 MMR, or Platinum 2, up to 33% of my games are playing against smurfs and sandbaggers who are actually 3300-3600 MMR points, which nearly guarantees that the game will end in an unfair loss. What sandbaggers/smurfs do is that they leave 4-7 games in a row, or atleast one game for every game they won, when their account is currently under 500 MMR their main account or actual rating. As a result, they will always be getting matched against players who are weaker than them, and win, depending on how many games they decide to leave. Since the other 70% of players are not smurfs or sandbaggers, the only way they can lose is if they get matched against another smurf/sandbagger, which might occur in less than 5-10% of total games, and isn't a problem for the smurf/sandbagger. Keep in mind that the match making system does not address smurfs and sandbaggers, so it doesn't mean that a player going on a win streak is going to get matched against another player going on a win streak. In fact, the only reason I was able to get promoted from Gold 2 to Platinum 3 was having to both play better than my actual rating, and not get matched against smurfs and sandbaggers. If Blizzard did actually address the sandbagger smurf problem with Sc2, I would actually be in Diamond 2 at this point, and not have to be stuck in Platinum 2.",
        "date": "8/9/25"
    }
]
